#include "STLAutoLock.h"


//======================================================================
// 函数名称:STLAutoLock()
// 功能描述:构造函数
// 输入参数:mutex=临界区
// 输出参数:
// 返 回 值:
// 创建日期:2006-03-27
// 修改日期:
// 作    者:胡鹏武
// 备    注:根据对象的生存期的原理,在对象的生成阶段进行临界区锁定的操作	
//======================================================================
STLAutoLock::STLAutoLock(mutex& mutex)
{
	this->mutexRef = &mutex;
	this->mutexRef->lock();
}

//======================================================================
// 函数名称:~STLAutoLock()
// 功能描述:析构函数
// 输入参数:
// 输出参数:
// 返 回 值:
// 创建日期:2006-03-27
// 修改日期:
// 作    者:胡鹏武
// 备    注:根据对象的生存期的原理,在对象的销毁阶段进行临界区解锁的操作	
//======================================================================
STLAutoLock::~STLAutoLock()
{
	this->mutexRef->unlock();
}
